RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_ethif.h
/***************************************************************************//**
* \file cy_ethif.h
* \version 1.0
*
* Provides an API declaration of the Ethernet Interface driver
*
********************************************************************************
* \copyright
* Copyright 2020 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_ethif
* \{
*
* Ethernet is a well-defined industry specification. Ethernet MAC module
* transmits and receives IEEE 802.3 frames by connecting with the PHY device
* using MII/RMII/GMII or RGMII interface. Ethernet MAC also supports 10/100/1000
* Transfer rates and IEEE 1588 time stamp feature. Infineon uses a third-party
* Ethernet MAC IP from Cadence GEM_GXL, which is a Gigabit Ethernet MAC.
*
* Below block diagram shows the hardware and software partition inside the MCU.
* Ethernet MAC IP hardware directly interface with external ethernet PHY via MII
* or RMII or GMII or RGMII interface and MDIO interface is for configuring the
* Ethernet PHY chip/device. The software section consists of three major layers
* Ethernet PDL (Peripheral Driver Library), Connectivity Middleware, and
* Applications. Ethernet PDL implements  low level driver for Ethernet MAC and a
* generic driver for the external Ethernet PHY chips.
*
* \image html ethernet_system.png "Ethernet Block Diagram"
*
* The ETHIF driver is wrapper around Cadence's EMAC core driver. This is a
* network interface driver to Cadence core EMAC driver. It provides APIs to
* communicate with Ethernet IP. The PHY driver also uses this driver to
* communicate with PHY chip (via application). This driver has internal buffer
* management, handling callbacks from Cadence EMAC during transport, etc.
*
* The functions and other declarations used in this driver are in cy_ethif.h.
* You can include cy_pdl.h (ModusToolbox only) to get access to all functions
* and declarations in the PDL.
*
* \section group_ethif_tx_rx_programming Tx/Rx Programming
*
* 1. Make sure all the pins connected between MAC and PHY is configured properly.
* 2. Enable Interrupts for Ethernet queues. This is used to receive events from driver.
* 3. Initialize MAC using \ref Cy_ETHIF_Init() API.
* 4. Optionally set filters.
* 5. PHY chip is outside of silicon. Initialize PHY using EPHY driver. Some PHY chip
*    needs configuration using it's proprietary(extended) registers. Fo this
*    refer to PHY data sheet.
* 6. Wait for link to be up. This can be done using EPHY APIs.
* 7. Once is link is up, then transmit frame using \ref Cy_ETHIF_TransmitFrame() API.
* 8. The receive callback is called when there is any frame received by MAC. The
*    receive callback is registered during \ref Cy_ETHIF_Init() API call.
*
* \section group_ethif_more_information More Information
*
* Refer to the technical reference manual (TRM) and the device datasheet.
*
* \section group_ethif_MISRA MISRA-C Compliance
* The Ethernet driver has no specific deviations
*
* \section group_ethif_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_ethif_macros Macros
* \defgroup group_ethif_functions Functions
* \defgroup group_ethif_data_structures Data Structures
* \defgroup group_ethif_enums Enumerated Types
*/

#if !defined (CY_ETHIF_H)
#define CY_ETHIF_H

#include "cy_device.h"

#if defined (CY_IP_MXETH)

#include <stddef.h>
#include "cy_syslib.h"
#include "cdn_errno.h"
#include "cedi.h"
#include "emac_regs_macro.h"
#include "edd_int.h"

#if defined(__cplusplus)
extern "C" {
#endif

/** \addtogroup group_ethif_macros
* \{
*/

/** Driver major version */
#define CY_ETHIF_DRV_VERSION_MAJOR        1

/** Driver minor version */
#define CY_ETHIF_DRV_VERSION_MINOR        0

/** Eth driver ID */
#define CY_ETHIF_ID                     CY_PDL_DRV_ID(0x71U)

/** \} group_ethif_macros */

/***************************************
*        Constants
***************************************/

/** \cond INTERNAL */

/*##############################################################################
*                   USER DEFINES
*#############################################################################*/
/** Ethernet configurations constants  */
#define CY_ETH_STANDARD_BD                  (0U)                         /* Standard Buffer Descriptor Mode */
#define CY_ETH_EXTENDED_BD                  (1U)                         /* Extended Buffer Descriptor Mode */

/* DMA operational mode */
#define CY_ETH_TX_FSFM                      (0U)                         /* Full Store and Forward Mode [FSFM] for Tx */
#define CY_ETH_TX_PSFM                      (1U)                         /* Partial Store and Forward Mode [PSFM] for Tx */
#define CY_ETH_RX_FSFM                      (2U)                         /* Full Store and Forward Mode for Rx */
#define CY_ETH_RX_PSFM                      (3U)                         /* Partial Store and Forward Mode for Rx */

/** Ethernet channel  */
#define CY_ETH_DEFINE_NUM_IP                (CY_IP_MXETH_INSTANCES)      /* Number of Ethernet channels intended to use, maximum 2 */
#define CY_ETH_DEFINE_NUM_RXQS              (2U)                         /* Number of queues intended to use, maximum 2 */
#define CY_ETH_DEFINE_NUM_TXQS              (3U)                         /* Number of queues intended to use, maximum 3 */

