RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_ethif.h
/** Ethernet Operation Mode */
#define CY_ETH_DEFINE_TX_OP_MODE            CY_ETH_TX_FSFM               /* FSFM OR PSFM */
#define CY_ETH_DEFINE_RX_OP_MODE            CY_ETH_RX_FSFM               /* FSFM OR PSFM */
#define CY_ETH_DEFINE_TX_WATERMARK          (50U)                        /* Watermark level for Tx */
#define CY_ETH_DEFINE_RX_WATERMARK          (50U)                        /* Watermark level for Rx */

/** Buffer Descriptor mode  */
#define CY_ETH_DEFINE_BD                    CY_ETH_EXTENDED_BD           /* standard or extended */

/** Memory Allocation defines */                                         /* Frame Buffers are allocated based on number of buffer descriptors */
#define CY_ETH_DEFINE_TOTAL_BD_PER_TXQUEUE  (2U)                         /* Total number of Buffer Descriptors allocated for each transmit queue */
#define CY_ETH_DEFINE_TOTAL_BD_PER_RXQUEUE  (4U)                         /* Total number of Buffer Descriptors allocated for each receive queue */
/*############################################################################*/


/** Ethernet configurations constants  */
#define CY_ETH_TX_PBUF_SIZE                 (0x1U)                          /* dma_config[bit-10] 1: Use full configured addressable space (4Kb) */
#define CY_ETH_RX_PBUF_SIZE                 (0x3U)                          /* dma_config[bit-8:9]3: Use full configured addressable space (8Kb) */

/** Ethernet channel  */
#define CY_ETHIF_INSTANCE_0                 (0U)                            /* channel ETH0 considered instance 0 for driver reference */
#define CY_ETHIF_INSTANCE_1                 (1U)                            /* channel ETH1 considered instance 1 for driver reference */

#define CY_ETH0_TYPE                        (ETH0)                          /* This includes both GEMGXL and Wrapper */
#define CY_ETH0_ADDR_REG_BASE               (ETH0_BASE)                     /* Register area for ETH0 */
#define CY_ETH0_GEMGXL_ADDR_REGBASE         (ETH0_BASE + 0x00001000UL)        /* Register area for GEMGXL */

#if (CY_IP_MXETH_INSTANCES > 1u)
#define CY_ETH1_TYPE                        (ETH1)                          /* This includes both GEMGXL and Wrapper */
#define CY_ETH1_ADDR_REG_BASE               (ETH1_BASE)                     /* Register area for ETH1 */
#define CY_ETH1_GEMGXL_ADDR_REGBASE         (ETH1_BASE + 0x00001000UL)        /* Register area for GEMGXL */
#endif /* (CY_IP_MXETH_INSTANCES > 1u) */

/** Driver constants    */
#define CY_ETH_SIZE_MIN_FRAME               (64U)                           /* Min Frame size */
#define CY_ETH_SIZE_MAX_FRAME               (1536U)                         /* Max Frame size */
#define CY_ETH_SIZE_BUF_TXQ_RXQ             (1536U)                         /* Tx/Rx buffer size */

#if (CY_ETH_DEFINE_BD == CY_ETH_EXTENDED_BD)
#define CY_ETH_BD_SIZE                      (16U)                           /* 16 Bytes */
#else
#define CY_ETH_BD_SIZE                      (8U)                            /* 8 Bytes */
#endif

#define CY_ETH_DISABLE_0                    (0U)
#define CY_ETH_ENABLE_1                     (1U)
#define CY_ETH_MDIO_BUSY_0                  (0U)
#define CY_ETH_MDIO_IDLE_1                  (1U)
#define CY_ETH_QS0_0                        (0U)
#define CY_ETH_QS1_1                        (1U)
#define CY_ETH_QS2_2                        (2U)
#define CY_ETH_QS3_3                        (3U)
#define CY_ETH_NOT_INITIALIZE_0             (0U)
#define CY_ETH_INITIALIZE_1                 (1U)
#define CY_ETHIF_BUFFER_CLEARED_0           (0U)

#define CY_ETH_TOTAL_TX_BUF                 (CY_ETH_DEFINE_NUM_IP * CY_ETH_DEFINE_NUM_TXQS * CY_ETH_DEFINE_TOTAL_BD_PER_TXQUEUE)
#define CY_ETH_TOTAL_RX_BUF                 (CY_ETH_DEFINE_NUM_IP * CY_ETH_DEFINE_NUM_RXQS * CY_ETH_DEFINE_TOTAL_BD_PER_RXQUEUE * 2U)   // *2 is to replace the already provided buffer to BDs

#define CY_ETHIF_NO_BUFFER_AVAILABLE        (255U)
#define CY_ETHIF_BUFFER_AVAILABLE           (254U)

#define CY_ETHIF_MDIO_READ_FAILED           (2U)
#define CY_ETHIF_PHY_FLAG                   (0U)                         // defines clause 22

#define CY_ETHIF_TX_STATUS_CLEAR            (0x000001FFUL)

#define CY_EHTIF_EMPTYVALUE                 (0xBAADF00DUL)

#define CY_ETHIF_PAUSE_P0                   (0U)
#define CY_ETHIF_PAUSE_P1                   (1U)
#define CY_ETHIF_PAUSE_P2                   (2U)
#define CY_ETHIF_PAUSE_P3                   (3U)
#define CY_ETHIF_PAUSE_P4                   (4U)
#define CY_ETHIF_PAUSE_P5                   (5U)
#define CY_ETHIF_PAUSE_P6                   (6U)
#define CY_ETHIF_PAUSE_P7                   (7U)

#if (CY_IP_MXETH_INSTANCES > 1u)
    #define CY_ETHIF_IS_IP_INSTANCE_VALID(base) (((base) == CY_ETH0_TYPE) || ((base) == CY_ETH1_TYPE))
    #define CY_ETHIF_IP_INSTANCE(base) (((base) == CY_ETH0_TYPE) ? CY_ETHIF_INSTANCE_0 : CY_ETHIF_INSTANCE_1)
    #define CY_ETHIF_IP_ADDR_REGBASE(instance) (((instance) == CY_ETHIF_INSTANCE_0) ? CY_ETH0_TYPE : CY_ETH1_TYPE)
    #define CY_ETHIF_GEMGXL_ADDR_REGBASE(instance) (((instance) == CY_ETHIF_INSTANCE_0) ? CY_ETH0_GEMGXL_ADDR_REGBASE : CY_ETH1_GEMGXL_ADDR_REGBASE)
#else
    #define CY_ETHIF_IS_IP_INSTANCE_VALID(base) ((base) == CY_ETH0_TYPE)
    #define CY_ETHIF_IP_INSTANCE(base) (((base) == CY_ETH0_TYPE) ? CY_ETHIF_INSTANCE_0 : CY_ETHIF_INSTANCE_0)
    #define CY_ETHIF_IP_ADDR_REGBASE(instance) (((instance) == CY_ETHIF_INSTANCE_0) ? CY_ETH0_TYPE : CY_ETH0_TYPE)
    #define CY_ETHIF_GEMGXL_ADDR_REGBASE(instance) (((instance) == CY_ETHIF_INSTANCE_0) ? CY_ETH0_GEMGXL_ADDR_REGBASE : CY_ETH0_GEMGXL_ADDR_REGBASE)
#endif

/** \endcond */

/** \addtogroup group_ethif_macros
* \{
*/

/* Bit-flags to specify DMA config register bits 24-27; see EMAC User Guide for details. */
#define CY_ETHIF_CFG_DMA_DISC_RXP           (0x01U) /**< The DMA will automatically discard receive packets from the receiver packet buffer memory when no AMBA (AXI) resource is available. */
#define CY_ETHIF_CFG_DMA_FRCE_RX_BRST       (0x02U) /**< Force the RX DMA to always issue max length bursts on EOP(end of packet) or EOB(end of buffer) transfers. */
#define CY_ETHIF_CFG_DMA_FRCE_TX_BRST       (0x04U) /**< Force the TX DMA to always issue max length bursts on EOP(end of packet) or EOB(end of buffer) transfers. */

/** \} group_ethif_macros */

